Revit 2026 API

# GeometryElementGetEnumerator Method

---

Returns an enumerator that iterates through the collection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual IEnumerator<GeometryObject> GetEnumerator()
```
```vb
Public Overridable Function GetEnumerator As IEnumerator(Of GeometryObject)
```
```cpp
public:
virtual IEnumerator<GeometryObject^>^ GetEnumerator()
```
```fsharp
abstract GetEnumerator : unit -> IEnumerator<GeometryObject>
override GetEnumerator : unit -> IEnumerator<GeometryObject>
```

#### Return Value

IEnumeratorGeometryObjectAn IEnumerator(GeometryObject) object that can be used to iterate through the collection.

#### Implements

IEnumerableTGetEnumerator

#### Reference

GeometryElement Class

Autodesk.Revit.DB Namespace